### 매개변수와 인자

- 매개변수와 인자의 차이점은 쓰임의 차이에 있습니다. 함수를 정의할 때 사용되는 변수를 매개변수, 실제로 함수가 호출될 때 넘기는 변수값을 인자라고 설명할 수 있다.

출처: https://7942yongdae.tistory.com/155

In [4]:
# 구구단

for i in range(2,10):
  for j in range(1,10):
    print(f'{i}*{j}={i*j}')

2*1=2
2*2=4
2*3=6
2*4=8
2*5=10
2*6=12
2*7=14
2*8=16
2*9=18
3*1=3
3*2=6
3*3=9
3*4=12
3*5=15
3*6=18
3*7=21
3*8=24
3*9=27
4*1=4
4*2=8
4*3=12
4*4=16
4*5=20
4*6=24
4*7=28
4*8=32
4*9=36
5*1=5
5*2=10
5*3=15
5*4=20
5*5=25
5*6=30
5*7=35
5*8=40
5*9=45
6*1=6
6*2=12
6*3=18
6*4=24
6*5=30
6*6=36
6*7=42
6*8=48
6*9=54
7*1=7
7*2=14
7*3=21
7*4=28
7*5=35
7*6=42
7*7=49
7*8=56
7*9=63
8*1=8
8*2=16
8*3=24
8*4=32
8*5=40
8*6=48
8*7=56
8*8=64
8*9=72
9*1=9
9*2=18
9*3=27
9*4=36
9*5=45
9*6=54
9*7=63
9*8=72
9*9=81

### Q. 이전에 본 타이타닉에는 어떤 datatype의 데이터가 들어있을까?

In [5]:
import pandas as pd

df = pd.read_csv('/content/drive/MyDrive/titanic_train.csv')

In [6]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

#### Q. object는 sting only인가?

A. text or mixed (numeric and non-numeric)

pandas data type : https://pbpython.com/pandas_dtypes.html

### Q. NoneType, none, null의 차이

값이 없다 : none
어떻게 보여줄것인가

none 이 nonetype 

null

데이터베이스 : null



#### 내가 알고 있는 null : dataframe에서 값이 들어오지 않을때 null/NAN
보통 NULL이 있으면 `fillna()`로 처리할 생각부터 하지 ;;

1. NoneType값이 `없음 None을 나타내는 객체` 인 **객체** 의 유형

파이썬에서는 값은 있지만 의도적으로 비어있는 상태인 **null**과 변수 선언만 되어있고 값이 할당 되어있지 않은 **undefined** 를 구분하지않고 nontype(class nontype)로 통칭.

- 아무것도 반환하지 않는 함수의 반환 값입니다. >> null
- 무언가를 검색하고 찾을 수 있거나 찾을 수없는 함수에 대한 일반적인 기본 반환 값입니다. 
예를 들어, 정규 표현식이 일치하지 않거나 키에 dict에 항목이 없을 때 반환됩니다.

- 출처: https://velog.io/@tritny6516/null-undefined%EC%9D%80-%EB%AC%B4%EC%97%87%EC%9D%B8%EA%B0%80-None
- 출처 : http://daplus.net/python-nonetype%EA%B0%9C%EC%B2%B4-%EB%9E%80-%EB%AC%B4%EC%97%87%EC%9E%85%EB%8B%88%EA%B9%8C/

In [8]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [20]:
df[df['Age'].isnull()][['Cabin','Age']]

    Cabin  Age
5     NaN  NaN
17    NaN  NaN
19    NaN  NaN
26    NaN  NaN
28    NaN  NaN
..    ...  ...
859   NaN  NaN
863   NaN  NaN
868   NaN  NaN
878   NaN  NaN
888   NaN  NaN

[177 rows x 2 columns]

In [21]:
df[['Cabin','Age']]

    Cabin   Age
0     NaN  22.0
1     C85  38.0
2     NaN  26.0
3    C123  35.0
4     NaN  35.0
..    ...   ...
886   NaN  27.0
887   B42  19.0
888   NaN   NaN
889  C148  26.0
890   NaN  32.0

[891 rows x 2 columns]

In [24]:
data_prep = df.fillna({'Age':df['Age'].mean()})
data_prep.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [26]:
dict_key = {name: ""7D 건조 망고"" , type: ""당절임""}

SyntaxError: ignored

In [27]:
dict_key = {'name': ""7D 건조 망고"" , type: ""당절임""}

SyntaxError: ignored

https://gsmesie692.tistory.com/94

https://www.youtube.com/watch?v=HraOg7W3VAM

https://velog.io/@tritny6516/null-undefined%EC%9D%80-%EB%AC%B4%EC%97%87%EC%9D%B8%EA%B0%80-None

In [36]:
numbers = [1,2,3,4,5,6,1,1,3,4,4,3,7,8,9,9,0,7,5,6,4,3,2,2,7,4,5,6]

counter = {}


for i in range(len(numbers)):
  x=numbers[i]
  if x in counter:
    counter[x]+=1
  else:
    counter[x]=1
    

print (counter)
#{1: 3, 2: 3, 3: 4, 4: 5, 5: 3, 6: 3, 7: 3, 8: 1, 9: 2, 0: 1}

{1: 3, 2: 3, 3: 4, 4: 5, 5: 3, 6: 3, 7: 3, 8: 1, 9: 2, 0: 1}

In [37]:
a = {1, 2, 3, 4}
b = {3, 4, 5, 6}

In [38]:
set.union(a,b)

{1, 2, 3, 4, 5, 6}

In [39]:
set.intersection(a,b)

{3, 4}

In [40]:
for i in a:
  print(i)

1
2
3
4

In [41]:
{i for i in 'pineapple' if i not in 'apl' }

{'e', 'i', 'n'}

In [44]:
a=set()
for x in 'pineapple':
  if x not in 'apl':
    a.add(x)
print(a)

{'e', 'n', 'i'}

In [55]:
# 반복문으로 n-gram 출력하기
## N-gram : 문자열에서 N개의 연속된 요소

text = 'hello'

for i in range(len(text)-1):
  print(text[i], text[i+1], sep='')

he
el
ll
lo

In [56]:
# 반복문으로 n-gram 출력하기
## N-gram : 문자열에서 N개의 연속된 요소

## 2-gram
text = 'hello'

for i in range(len(text)-1):
  print(text[i], text[i+1], sep='')

he
el
ll
lo

In [68]:
#zip이해하기 
a = "12345"
b = "qwert"
c = "asdfg"

for x, y, z in zip(a, b, c):
	print(x, y, z)

1 q a
2 w s
3 e d
4 r f
5 t g

In [69]:
list1 = [1, 2, 3, 4, 5]
list2 = ["one", "two", "three"]

for x, y in zip(list1, list2) :
  print(x, y)

1 one
2 two
3 three

In [70]:
text = 'hello'

print(text)
print(text[1:])

hello
ello

In [57]:
text = 'hello'
list(zip(text, text[1:]))

[('h', 'e'), ('e', 'l'), ('l', 'l'), ('l', 'o')]

In [72]:
text = 'this is python script'
words = text.split()
print(words)
print(words[1:])

['this', 'is', 'python', 'script']
['is', 'python', 'script']

In [73]:
list(zip(words, words[1:]))

[('this', 'is'), ('is', 'python'), ('python', 'script')]

### 3-gram

In [78]:
#zip 사용
text = 'hello'
print([text[i:] for i in range(3)])
print(list(zip([text[i:] for i in range(3)])))
print(list(zip(*[text[i:] for i in range(3)])))

['hello', 'ello', 'llo']
[('hello',), ('ello',), ('llo',)]
[('h', 'e', 'l'), ('e', 'l', 'l'), ('l', 'l', 'o')]

In [61]:
list(zip(['hello', 'ello', 'llo']))

[('hello',), ('ello',), ('llo',)]

zip은 반복 가능한 객체 여러 개를 콤마로 구분해서 넣어줘야 합니다. 

하지만 ['hello', 'ello', 'llo']은 요소가 3개 들어있는 `리스트 1`개이기 때문입니다.

zip에 리스트의 각 요소를 콤마로 구분해서 넣어주려면 리스트 앞에 *를 붙여야 합니다.

In [60]:
list(zip(*['hello', 'ello', 'llo']))

[('h', 'e', 'l'), ('e', 'l', 'l'), ('l', 'l', 'o')]

In [74]:
list(zip('hello', 'ello'))

[('h', 'e'), ('e', 'l'), ('l', 'l'), ('l', 'o')]

In [76]:
list(zip(*[text[i:] for i in range(3)]))

[('t', 'h', 'i'),
 ('h', 'i', 's'),
 ('i', 's', ' '),
 ('s', ' ', 'i'),
 (' ', 'i', 's'),
 ('i', 's', ' '),
 ('s', ' ', 'p'),
 (' ', 'p', 'y'),
 ('p', 'y', 't'),
 ('y', 't', 'h'),
 ('t', 'h', 'o'),
 ('h', 'o', 'n'),
 ('o', 'n', ' '),
 ('n', ' ', 's'),
 (' ', 's', 'c'),
 ('s', 'c', 'r'),
 ('c', 'r', 'i'),
 ('r', 'i', 'p'),
 ('i', 'p', 't')]

In [79]:
n = int(input())
text = input()
words = text.split()        
 
if len(words) < n:
    print('wrong')
else:
    n_gram = zip(*[words[i:] for i in range(n)])                                
    for i in n_gram:
        print(i)

7
Python is a programming language
wrong